In [2]:
import pandas as pd
import numpy as np

In [5]:
bank_df=pd.read_csv(r"C:\Users\Vyshnavi\OneDrive\Documents\Data Science\Naresh IT\Data Files\bank-additional.csv",sep=';')
bank_df.head(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no

In [5]:
import pandas as pd
import numpy as np

In [25]:
dict1={'Names':['Harshini','Vyshnavi',np.nan,'Rajeev'],
      'Age':[np.nan,24,21,30],
      'City':['Hyd','Blr','Chennai',np.nan]}

dict1

{'Names': ['Harshini', 'Vyshnavi', nan, 'Rajeev'],
 'Age': [nan, 24, 21, 30],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [26]:
pd.DataFrame(dict1)

      Names   Age     City
0  Harshini   NaN      Hyd
1  Vyshnavi  24.0      Blr
2       NaN  21.0  Chennai
3    Rajeev  30.0      NaN

In [27]:
d1=pd.DataFrame(dict1)

In [28]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [29]:
dict2={'Names':['Harshini','Vyshnavi',None,'Raeev'],
      'Age':[np.nan,24,21,30],
      'City':['Hyd','Blr','Chennai',None]}

pd.DataFrame(dict2)

      Names   Age     City
0  Harshini   NaN      Hyd
1  Vyshnavi  24.0      Blr
2      None  21.0  Chennai
3     Raeev  30.0     None

In [30]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [31]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [32]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: not a number this applicable or numerical columns only

- Generally data has some empty rows

- It is data problem

- If you read that kind of data you will see null

- You need to understand it is data corrupted or really a Null values are there

**Method-1**

**Fill with some random value**

**Method name:fill na**

In [33]:
d1.fillna(40)

      Names   Age     City
0  Harshini  40.0      Hyd
1  Vyshnavi  24.0      Blr
2        40  21.0  Chennai
3    Rajeev  30.0       40

**Method_2**


- we can fill the values w.r.t columns also

In [34]:
d1['Age'].fillna(40)

# it will not updated
# inplace=False
# it will update
# inplace=True

0    40.0
1    24.0
2    21.0
3    30.0
Name: Age, dtype: float64

In [35]:
d1

      Names   Age     City
0  Harshini   NaN      Hyd
1  Vyshnavi  24.0      Blr
2       NaN  21.0  Chennai
3    Rajeev  30.0      NaN

In [36]:
d1['Age'].fillna(40,inplace=True)

In [37]:
d1

      Names   Age     City
0  Harshini  40.0      Hyd
1  Vyshnavi  24.0      Blr
2       NaN  21.0  Chennai
3    Rajeev  30.0      NaN

In [38]:
d1['Age'].fillna(40,inplace=False)

0    40.0
1    24.0
2    21.0
3    30.0
Name: Age, dtype: float64

In [39]:
d1['City'].fillna('Hyd',inplace=True)

In [40]:
d1

      Names   Age     City
0  Harshini  40.0      Hyd
1  Vyshnavi  24.0      Blr
2       NaN  21.0  Chennai
3    Rajeev  30.0      Hyd

In [43]:
dict1={'Names':['Harshini','Vyshnavi',None,'Raeev'],
      'Age':[np.nan,24,21,30],
      'City':['Hyd','Blr','Chennai',None]}

d1=pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [45]:
d1.fillna(method='bfill')

# It will fill with below or next value
# column1: Names index 3 is missing values it is filled with index 4 values
# column2: Age index 1 is missing values it is filled with index 2 values
# column3: City index 4 is missing values it should be fill with next value
#          but we dont have next value

      Names   Age     City
0  Harshini  24.0      Hyd
1  Vyshnavi  24.0      Blr
2     Raeev  21.0  Chennai
3     Raeev  30.0     None

In [46]:
d1.fillna(method='ffill')

      Names   Age     City
0  Harshini   NaN      Hyd
1  Vyshnavi  24.0      Blr
2  Vyshnavi  21.0  Chennai
3     Raeev  30.0  Chennai

In [48]:
d1.fillna(method='pad')

      Names   Age     City
0  Harshini   NaN      Hyd
1  Vyshnavi  24.0      Blr
2  Vyshnavi  21.0  Chennai
3     Raeev  30.0  Chennai

In [51]:
d1.fillna(method='backfill')

      Names   Age     City
0  Harshini  24.0      Hyd
1  Vyshnavi  24.0      Blr
2     Raeev  21.0  Chennai
3     Raeev  30.0     None

In [50]:
d1.fillna(method='bfill',axis=1)

# axis=1 means columns
# so Nan values fill with next column

      Names   Age     City
0  Harshini   Hyd      Hyd
1  Vyshnavi  24.0      Blr
2      21.0  21.0  Chennai
3     Raeev  30.0     None

- backfill and bfill with next value

- pad and ffill with previous value

- bit it will change based on axis

**Method-4**

- mean

    - Numerical values can fill with mean value
    
    - but mean affect by outliers
    
    - if we dont have outliers it is best one
    
- medain

    - Numerical values can fill with medain value
    
    - we know that medain values does not affect with outliers
    
    - sp if outliers are there we can go with medain
    
- mode

    - Mode is useful or categorical data

In [52]:
dict1={'Names':['Harshini','Vyshnavi',None,'Raeev'],
      'Age':[np.nan,24,21,30],
      'City':['Hyd','Blr','Chennai',None]}

d1=pd.DataFrame(dict1)

In [55]:
# we already know we can fill with same values based on specific column using 
# d1.fillna(<random_number>)
# d1 represents all the column
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    25.0
1    24.0
2    21.0
3    30.0
Name: Age, dtype: float64

In [56]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    24.0
1    24.0
2    21.0
3    30.0
Name: Age, dtype: float64

In [57]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    24.0
2    21.0
3    30.0
Name: Age, dtype: float64

In [58]:
d1['City'].mode()
# in this use case we are getting mode equal
# but in real time we will get clear mode value

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random value

- Fill with random value on specific value

- Fill with methods

    - bfill
    
    - ffill
    
    - pad
    
    - backfill
    
- Fill with

    - Mean
    
    - Median
    
    - Mode

**Method-5**

**KNN imputer**

- KNN means : K neartest Neighbours
    
- K is a yper parameter means user can choose

- It is distance metric: **Euclidian distance**
    
- KNN imputer will take the mean of the neighbours value

- The neighbours value can provided by using value =k

- It is under sklearn package

- Under sklearn package

- Under imputer we have KnnImputer

- Applicable onle for Numerical data

<img id="dimg_235" src="" class="YQ4gaf" height="203" style="object-position:41% 16%" width="248" alt="Different Types of Distance Measures in Machine Learning - Analytics Yogi" data-cmp="1" data-flt="1718376804438" data-csiid="28" data-atf="1">

In [59]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[25.],
       [24.],
       [21.],
       [30.]])